<?php

use Illuminate\Database\Seeder;

class SubjectsTableSeeder extends Seeder
{
    public function run()
    {
        foreach (self::SEED_DATA['subjects'] as $subject) {
            $subjectModel = \App\Models\Subject::create([
                'name' => $subject['name']
            ]);
            foreach ($subject['topics'] as $topic) {
                $topicModel = \App\Models\Topic::create([
                    'name'          => $topic['name'],
                    'subject_id'    => $subjectModel->id
                ]);
                foreach ($topic['questions'] as $question) {
                    $questionModel = \App\Models\Question::create([
                        'text'          => $question['name'],
                        'subject_id'    => $subjectModel->id,
                        'topic_id'      => $topicModel->id,
                        'level'         => $question['level'],
                        'time'          => rand(5, 10)
                    ]);
                    foreach ($question['answers'] as $answer) {
                        $answerModel = \App\Models\Answer::create([
                            'text'              => $answer['name'],
                            'question_id'       => $questionModel->id,
                            'is_true_answer'    => $answer['is_true_answer']
                        ]);
                    }
                }
                foreach ($topic['keyWords'] as $keyWord) {
                    \App\Models\KeyWord::create([
                        'name'          => $keyWord,
                        'subject_id'    => $subjectModel->id,
                        'topic_id'      => $topicModel->id
                    ]);
                }
            }
        }
    }

    const SEED_DATA = [
        'subjects' => [
            [
                'name' => 'Դիսկրետ մաթեմատիկա',
                'topics' => [
                    [
                        'name' => 'Բինար հարաբերություններ։',
                        'questions' => [
                            [
                                'name' => 'Վերջավոր բազմություն։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Ցանկացած բազմություն վերջավոր է։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Բազմությունը կանվանենք վերջավոր, եթե գոյություն ունի n>=0 ամբողջ թիվ, այնպիսին, որ այդ բազմությանը պատկանում են ճիշտ n-1 հատ տարրեր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Բազմությունը կանվանենք վերջավոր, եթե գոյություն ունի n>=0 ամբողջ թիվ, այնպիսին, որ այդ բազմությանը պատկանում են ճիշտ n հատ տարրեր։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Բազմությունը կանվանենք վերջավոր, եթե այն փակ է և սահմանափակ։',
                                        'is_true_answer' => 0
                                    ],
                                ],
                            ],
                            [
                                'name' => 'Անվերջ բազմություն։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Բազմությունը կանվանենք անվերջ, եթե գոյություն չունի n>=0 ամբողջ թիվ, այնպիսին, որ այդ բազմությանը պատկանում են ճիշտ n հատ տարրեր։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Ցանկացած վերջավոր բազմություն նաև անվերջ է։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Բազմությունը կանվանենք անվերջ, եթե բոլոր տարրերի գումարը ձգտում է անվերջության։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Անվերջ բազմություններ չկան։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Երբ են A և B բազմությունները իրար հավասար։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Կասենք, որ A և B բազմությունները հավասար են, եթե պարունակում են նույն քանակությամբ տարրեր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Կասենք, որ A և B բազմությունները հավասար են, եթե A-ն ընկած է B-ի մեջ և B-ն ընկած է A-ի մեջ։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Կասենք, որ A և B բազմությունները հավասար են, եթե գոյություն ունի առնվազն մեկ ենթաբազմություն, որը գոյություն ունի և A-ում և B-ում։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Կասենք, որ A և B բազմությունները հավասար են, եթե գոյություն ունի առնվազն երկու ենթաբազմություն, որը գոյություն ունի և A-ում և B-ում։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'A և B բազմությունների դեկարտյան արտադրյալ։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'A և B բազմությունների դեկարտյան արտադրյալ կանվանենք այն բազմությունը, որի տարրերն են բոլոր հնարավոր (a, b) կարգավորված զույգերը, որտեղ a-ն A-ից է, իսկ b-ն B-ից։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'A և B բազմությունների դեկարտյան արտադրյալ կանվանենք այն բազմությունը, որի տարրերն են բոլոր հնարավոր (a, b) կարգավորված զույգերը, որտեղ a-ն և b-ն կամայական են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'A և B բազմությունների դեկարտյան արտադրյալ կանվանենք այն բազմությունը, որի տարրերն են բոլոր հնարավոր (a, b) կարգավորված զույգերը, որտեղ a-ն և b-ն A-ից են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'A և B բազմությունների դեկարտյան արտադրյալ կանվանենք այն բազմությունը, որի տարրերն են բոլոր հնարավոր և A-ից են և B-ից։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Կարգի հարաբերություն։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'Հարաբերությունը կոչվում է կարգի հարաբերություն, եթե այն սիմետրիկ է և ռեֆլեքսիվ։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Հարաբերությունը կոչվում է կարգի հարաբերություն, եթե այն անտիսիմետրիկ, ռեֆլեքսիվ Է։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Հարաբերությունը կոչվում է կարգի հարաբերություն, եթե այն անտիսիմետրիկ, տրանզիտիվ և ռեֆլեքսիվ Է։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Հարաբերությունը կոչվում է կարգի հարաբերություն, եթե այն տրանզիտիվ և ռեֆլեքսիվ Է։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'Վերջավոր բազմություն',
                            'Անվերջ բազմություն',
                            'Հավասար բազմություններ',
                            'Դեկարտյալ արտադրյալ',
                            'Կարգի հարաբերույթւն',
                        ]
                    ],
                    [
                        'name' => 'Կոմբինատորիկայի տարրերը։',
                        'questions' => [
                            [
                                'name' => 'Ընտրույթ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Ընտրույթ A բազմությունից կանվանենք այդ բազմության տարրերի ցանկացած հաջորդականաությունը։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Ընտրույթ A բազմությունից կանվանենք այդ բազմության տարրերի ցանկացած հաջորդականաություն, որտեղ բոլոր իրար հարևան տարրերը կարգավորված զույգ են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ընտրույթ A բազմությունից կանվանենք այդ բազմության տարրերի ցանկացած հաջորդականաություն, որտեղ բոլոր իրար հարևան տարրերը նույն են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ընտրույթ A բազմությունից կանվանենք այդ բազմության տարրերի ցանկացած հաջորդականաություն, որտեղ բոլոր իրար հարևան տարրերը տարբեր են։',
                                        'is_true_answer' => 0
                                    ]
                                ]
                            ],
                            [
                                'name' => 'Նշվածներից, որը ընտրույթ չէ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Կարգավորված ընտրույթ։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ընտրույթներ չկրկնվող տարրերով։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ընտրույթներ կրկնվող տարրերով։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ընտրույթներ մեկը մյուսից մեծ տարրերով։',
                                        'is_true_answer' => 1
                                    ]
                                ]
                            ],
                            [
                                'name' => 'Ովքեր էին հայտնի կոկոսյան ընկուզենիների խնդրի գործող անձինք։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Նավաստիները։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Ֆիզիկոսները։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Մաթեմատիկոսները։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Վթարված ինքնաթիռի ղեկավար անձնակազմը։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'Ընտրույթ'
                        ]
                    ],
                    [
                        'name' => 'Բուլյան ֆունկցիաներ։',
                        'questions' => [
                            [
                                'name' => 'Բուլյան ֆունկցիաները կարող ենք ներկայանցենլ նաև (լրացնել այս հատվածը) միջոցով։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'կոնյուկտիվ նորմալ ձևի',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'տարրական դիզունկցիայի',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'դիզյունկտիվ նորմալ ձևի',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'սահմանված տիրույթի վրա, իր ընդունած արշեքների գումարի',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ինչ է կոչվում միմյանցից տարբեր փոփոխականների կամ դրանց ժխտումների տրամաբանական գումարը։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'Տարրական դիզունկցիա։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Կոնյուկտիվ նորմալ ձև։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Դիզյունկտիվ նորմալ ձև։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Կարգավորված արժեք։։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ինքնաերկակի ֆունկցիաների դասը (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'լիրվ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'անվերջ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'փակ է',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'բաց է',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ]
                        ],
                        'keyWords' => [
                            'Կոնյուկտիվ նորմալ ձև',
                            'Տարրական դիզյունկցիա',
                            'Ինքնաերկակի ֆունկցիա',
                        ]
                    ],
                    [
                        'name' => 'Գրաֆների տեսության տարրերը։',
                        'questions' => [
                            [
                                'name' => 'Թեորեմ։ Ամեն մի G=(V,X) գրաֆում (լրացնել այս հատվածը) ունեցող գագաթների քանակը զույգ թիվ է։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'կենտ աստիճան',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'զույգ աստիճան',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'առնվազն մեկ կարգավորված զույգ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => '0 աստիճան',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Տրված է G=(V,X) գրաֆը։ Նրա գագաթների U1, U2, U3,..., Uk հաջորդականությունը կանվանենք U1-ից Uk ճանապարհ, եթե
                                    {U1, U2}, {U2, U3},...,{Uk, Uk-1}-ն G գրաֆի (շարունակել միտքը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'ցանկացած կողեր են',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'միմյանցից տարբեր կողեր են',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'նույն կողերն են',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'առնվազն մեկ ենթագրաֆի իրար հարևան կողեր են',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ամեն մի գրաֆ միարժեք ձևով ներկայացվում է իր (լրացնել այս հատվածը) ուղիղ գումարի տեսքով։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'կապակցված բաղադրիչների',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'իրար հարևան գագաթների',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'զույգ աստիճան ունեցող գագաթների',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'կենտ աստիճան ունեցող գագաթների',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Դիցուք G=(V, X)-ը որևէ գրաֆ է։ Ո՞րն է կոչվում Էլյերյան ճանապարհ։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'Կասենք, որ գրաֆում գոյություն ունի Էլյերյան ճանապարը, եթե կարելի է նշել այնպիսի ճանապարհ, որը պարունակում է գրաֆի բոլոր գագաթները։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Կասենք, որ գրաֆում գոյություն ունի Էլյերյան ճանապարը, եթե կարելի է նշել այնպիսի ճանապարհ, որը պարունակում է գրաֆի բոլոր կողերը։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Կասենք, որ գրաֆում գոյություն ունի Էլյերյան ճանապարը, եթե կարելի է նշել այնպիսի ճանապարհ, որը պարունակում է գրաֆի բոլոր կողերը և առնվազն մեկ գագաթ, որի ունի կենտ աստիճան։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Կասենք, որ գրաֆում գոյություն ունի Էլյերյան ճանապարը, եթե կարելի է նշել այնպիսի ճանապարհ, որը պարունակում է գրաֆի բոլոր գագաթները և կողերը։',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                            [
                                'name' => 'G=(V, X) կարգավոր զույգը անվանենք գրաֆ։ Որո՞նք են գրաֆի գագաթները և կողերը։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'X բազմության տարրերը գրաֆի գագաթներն են, V բազմության տարրերը գրաֆի կողերն են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X բազմության տարրերը գրաֆի կողերն են, V բազմության տարրերը գրաֆի գագաթներն են։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'X բազմության զույգ տարրերը գրաֆի կողերն են, V բազմության զույգ տարրերը գրաֆի գագաթներն են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X բազմության կենտ տարրերը գրաֆի կողերն են, V բազմության կենտ տարրերը գրաֆի գագաթներն են։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ]
                        ],
                        'keyWords' => [
                            'Ճանապարհ',
                            'Էյլերյան Ճանապարհ',
                            'գագաթ',
                            'կող',
                            'գրաֆ',
                        ]
                    ],
                ]
            ],
            [
                'name' => 'Մաթեմատիկական անալիզ',
                'topics' => [
                    [
                        'name' => 'Բազմություններ և հաջորդականություններ։',
                        'questions' => [
                            [
                                'name' => 'X={x} բազմությունը կոչվում է սահամանփակ վերևից, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x <= y անհավասրությունը',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x >= y անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x - y = 0 անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, բավարարվում է x <= y անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                ],
                            ],
                            [
                                'name' => 'X={x} բազմությունը սահամանփակ Է վերևից y կետով։ y-ը X բազմության (լրացնել այս հատվածը):',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'ճշգրիտ վերին եզրն է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'վերին եզրն է',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'ստորին սահմանն է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ճշգրիտ վերին սահմանն է',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'X={x} բազմությունը կոչվում է սահամանփակ ներքևից, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x <= y անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x >= y անհավասրությունը',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x - y = 0 անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, բավարարվում է x >
                                        = y անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ո՞ր հաջորդականությունն է կոչվում զուգամետ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Որն ունի ստորին ճշգրիտ եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որն ունի ստորին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որն ունի վերին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որն ունի սահման։',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Եթե հաջորդականությունը զուգամետ է, ապա (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'ունի մեկից ավել սահման',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'անսահմանափակ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'նրա սահմանը միակն է, և սահմանափակ է',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'ունի վերին մեկից ավել սահան, և սահմանափակ է',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ո՞ր հաջորդականությունն է կոչվում տարամետ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Որը չունի ստորին ճշգրիտ եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որը չունի ստորին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որը չունի սահման։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Որը չունի վերին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ։ Եթե {Xn} հաջորդականությունը մոնոտոն աճող է, և սահմանափակ է վերևից, ապա (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'նա տարամետ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'նա զուգամետ է',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'և տարամետ է, և զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ոչ տարամետ է, ոչ զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ։ Եթե {Xn} հաջորդականությունը մոնոտոն նվազող է, և սահմանափակ է ներքևից, ապա (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'նա տարամետ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'և տարամետ է, և զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ոչ տարամետ է, ոչ զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'նա զուգամետ է',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                            [
                                'name' => '{Xn} հաջորդականությունը կանվանենք մոնոտոն աճող է, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= 0',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= Xn+1',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= Xn+1 <= ...',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'X1 < X2 < X3 < ... < Xn <= Xn+1 <= ...',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => '{Xn} հաջորդականությունը կանվանենք մոնոտոն նվազող է, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'X1 >= X2 >= X3 >= ... >= Xn >= 0',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 >= X2 = X3 >= ... >= Xn >= Xn+1',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= Xn+1 <= ...',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 >= X2 >= X3 >= ... >= Xn >= Xn+1 >= ...',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'սահմանափակ վերևից',
                            'սահմանափակ ներքևից',
                            'վերին եզր',
                            'ճշգրիտ վերին եզր',
                            'զուգամետ հաջարդականություն',
                            'տարամետ հաջարդականություն',
                            'մոնոտոն աճող հաջարդականություն',
                            'մոնոտոն նվազող հաջարդականություն',
                        ]
                    ],
                    [
                        'name' => 'Անորոշ ինտեգրալ։',
                        'questions' => [
                            [
                                'name' => 'Ո՞րն է կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, որը պատկանում է X տիրույթին, F'(x) = f'(x)։",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, F'(x) = f(x)։",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, որը պատկանում է X տիրույթին, F'(x) = f(x)։",
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, F'(x) = f'(x)։",
                                        'is_true_answer' => 0
                                    ]
                                ]
                            ],
                            [
                                'name' => 'Ո՞րն է կոչվում f(x) ֆունկցիայի անորոշ ինտեգրալ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'f(x)-ի ցանակցած նախնական։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'f(x)-ի ամենամեծ արժեք ունեցող նախնականը։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'f(x)-ի բոլոր նախնականների հատումը։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'f(x)-ի բոլոր նախնականների համախումբը։',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ի՞նչը կարելի է դուրս բերել ինտեգրալի նշանի տակից։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Միայն բացասական գործակիցները։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Միայն դրական գործակիցները։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Հաստատուն արտադրիչը։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Ինտեգրալների գումարը։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'ֆունկցիայի նախնական',
                            'անորոշ ինտեգրալ',
                        ]
                    ],
                    [
                        'name' => 'Մի քանի փոփոխականների ֆունկցիաներ։',
                        'questions' => [
                            [
                                'name' => 'Նշվածներից, որն է հանդիսանում z=f(x, y) ֆունկցիայի (x0, y0) կետում, որպես անընդհատ ֆունկցիայի սահմանման կետ։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'Որոշված է (x0, y0) կետում։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Չունի վերջավոր սահման։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ունի վերջավոր սահման, x->y0, y->x0',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ունի վերջավոր սահման, x->y0, y->x0, և այդ սահմանը հավասար է (x0, y0) կետում ֆունկցիայի արժեքին',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ո՞րն է z=f(x, y) ֆունկցիայի աճը (x, y) կետում նկարագրող բանաձև։',
                                'level' => \App\Models\Question::LEVELS['high'],
                                'answers' => [
                                    [
                                        'name' => "Δz = f'x(x, y)Δx + f'x(x, y)Δy + αΔx + βΔy",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "Δz = f'x(x, y)Δx + f'y(x, y)Δy + (αΔx * βΔy)",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "Δz = f'x(x, y)Δx + f'y(x, y)Δy + αΔx + βΔy",
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => "Δz = f'x(x, y)Δx - f'y(x, y)Δy + αΔx + βΔy",
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => "Եթե z=f(x, y) ֆունկցիայի աճը (x, y) կետում կարելի է ներկայացնել Δz = f'x(x, y)Δx + f'y(x, y)Δy + αΔx + βΔy տեսքով, ապա f(x, y) ֆունկցիան այդ կետում կոչվում է (լրացնել այս հատվածը):",
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'ածանցելի',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'դիֆերենցելի',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'սահմանափակ վերևից',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'անընդհատ դիֆերենցելի',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալների մասին:',
                                'level' => \App\Models\Question::LEVELS['high'],
                                'answers' => [
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնք իրարից տարբերվում են միայն ածանցման հերթականությամբ, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնք իրարից տարբերվում են ընդունած արժեքներով, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնց ածանցման հերթականությունը նույնն է, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնց ածանցման հերթականությունը հաջորդում են իրար, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ: Էքստրեմումի գոյության անհրաժեշտ պայմանը:',
                                'level' => \App\Models\Question::LEVELS['high'],
                                'answers' => [
                                    [
                                        'name' => 'Եթե z=f(x,y) դիֆերենցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի մասնակի ածանցյալները P կետում հավասար են 0-ի:',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Եթե z=f(x,y) դիֆերենցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի մասնակի ածանցյալները P կետում հավասար է են ֆունկցիայի ընդունած մեծագույն արժեքին:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե z=f(x,y) ածանցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի խաղը մասնակի ածանցյալները P կետում հավասար են 0-ի:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե z=f(x,y) ածանցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի մասնակի ածանցյալները P կետում փոքր են 0-ից:',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ]
                        ],
                        'keyWords' => [
                            'Անընդհատ ֆունկցիա',
                            'Ֆունկցիայի աճ',
                            'Դիֆերենցելի ֆունկցիա',
                            'Թեորեմ երկու խառը մասնակի ածանցյալների մասին',
                            'Էքստրեմումի գոյության անհրաժեշտ պայման',
                        ]
                    ],
                    [
                        'name' => 'Իրական և կոմպլեքս թվեր։',
                        'questions' => [
                            [
                                'name' => 'Կոմպլեքս թվերը համարվում են (լրացնել այս հատվածը):',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'իռացիոնալ թվեր',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'իրական թվերի դաշտի ընդլայնում',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'խորանարդ աստիճանի հավասարումների արմատներ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ռացիոնալ թվեր',
                                        'is_true_answer' => 0
                                    ]
                                ]
                            ],
                            [
                                'name' => 'Կոմպլեքս թվերին անվանում են նաև:',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'խաբուսիկ թվեր',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'իրական թվեր',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'կեղծ թվեր',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'անհայտ թվեր',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Նշվածներից ո՞րն է կոմպլեքս թվի ներկայացում։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'x + iy, որտեղ x-ը և y-ը իրական թվեր են, իսկ i-ն ռացիոնալ։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'x + iy, որտեղ x-ը իրական թիվ է, իսկ y-ը և i-ն կեղծ միավորներ են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'x + iy, որտեղ x-ը և y-ը իրական թվեր են, իսկ i-ն կեղծ միավոր է։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'x + iy, որտեղ x-ը և y-ը կոմպլեքս թվեր են, իսկ i-ն կեղծ միավոր է։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Կոմպլեքս թվերի հավասարությունը տեղի ունի, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'հավասար են նրանց իրական և կեղծ մասերը',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'հավասար են նրանց կեղծ մասերը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'հավասար են նրանց իրական մասերը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'հավասար են նրանց իրական կամ կեղծ մասերը',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'Կոմպլեքս թիվ',
                            'Կեղծ միավոր',
                            'Կոմպլեքս թվերի հավասարություն',
                        ]
                    ],
                ],
            ],
            [
                'name' => 'Գծային հանրահաշիվ',
                'topics' => [
                    [
                        'name' => 'Գծային տարածություն։',
                        'questions' => [
                            [
                                'name' => 'Ո՞րն է կոչվում գծային տարածություն։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'L բազմությունը կոչվում է գծային տարածություն K դաշտի նկատմամբ, եթե նրա վրա սահմանված են գումարման և թվով բազմապատկման գործողություններ։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'L բազմությունը կոչվում է գծային տարածություն K դաշտի նկատմամբ, եթե նրա վրա սահմանված են գումարման և թվով բազմապատկման գործողություններ, որոնք բավարարում են λ(a + b) = λa + λb, (λ + μ)a = λa + μa։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'L բազմությունը կոչվում է գծային տարածություն K դաշտի նկատմամբ, եթե նրա վրա սահմանված են գումարման և թվով բազմապատկման գործողություններ, որոնք բավարարում են λ(a + b) = λa + λb + 2ab, (λ + μ)a = λa + μa։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'L բազմությունը կոչվում է գծային տարածություն K դաշտի նկատմամբ, եթե նրա վրա սահմանված են գումարման և թվով բազմապատկման գործողություններ, որոնք բավարարում են (λ + μ)a = λa + μa։',
                                        'is_true_answer' => 0
                                    ],
                                ],
                            ],
                            [
                                'name' => 'X={x} բազմությունը սահամանփակ Է վերևից y կետով։ y-ը X բազմության (լրացնել այս հատվածը):',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'ճշգրիտ վերին եզրն է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'վերին եզրն է',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'ստորին սահմանն է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ճշգրիտ վերին սահմանն է',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'X={x} բազմությունը կոչվում է սահամանփակ ներքևից, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x <= y անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x >= y անհավասրությունը',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, որը պատկանում է X բազմությանը, բավարարվում է x - y = 0 անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'գոյություն ունի y թիվ, այնպիսին, որ ցանկացած x տարրի համար, բավարարվում է x >
                                        = y անհավասրությունը',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ո՞ր հաջորդականությունն է կոչվում զուգամետ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Որն ունի ստորին ճշգրիտ եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որն ունի ստորին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որն ունի վերին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որն ունի սահման։',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Եթե հաջորդականությունը զուգամետ է, ապա (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'ունի մեկից ավել սահման',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'անսահմանափակ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'նրա սահմանը միակն է, և սահմանափակ է',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'ունի վերին մեկից ավել սահան, և սահմանափակ է',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ո՞ր հաջորդականությունն է կոչվում տարամետ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Որը չունի ստորին ճշգրիտ եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որը չունի ստորին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Որը չունի սահման։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Որը չունի վերին եզր։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ։ Եթե {Xn} հաջորդականությունը մոնոտոն աճող է, և սահմանափակ է վերևից, ապա (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'նա տարամետ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'նա զուգամետ է',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'և տարամետ է, և զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ոչ տարամետ է, ոչ զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ։ Եթե {Xn} հաջորդականությունը մոնոտոն նվազող է, և սահմանափակ է ներքևից, ապա (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'նա տարամետ է',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'և տարամետ է, և զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ոչ տարամետ է, ոչ զուգամետ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'նա զուգամետ է',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                            [
                                'name' => '{Xn} հաջորդականությունը կանվանենք մոնոտոն աճող է, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= 0',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= Xn+1',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= Xn+1 <= ...',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'X1 < X2 < X3 < ... < Xn <= Xn+1 <= ...',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => '{Xn} հաջորդականությունը կանվանենք մոնոտոն նվազող է, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'X1 >= X2 >= X3 >= ... >= Xn >= 0',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 >= X2 = X3 >= ... >= Xn >= Xn+1',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 <= X2 <= X3 <= ... <= Xn <= Xn+1 <= ...',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'X1 >= X2 >= X3 >= ... >= Xn >= Xn+1 >= ...',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'սահմանափակ վերևից',
                            'սահմանափակ ներքևից',
                            'վերին եզր',
                            'ճշգրիտ վերին եզր',
                            'զուգամետ հաջարդականություն',
                            'տարամետ հաջարդականություն',
                            'մոնոտոն աճող հաջարդականություն',
                            'մոնոտոն նվազող հաջարդականություն',
                        ]
                    ],
                    [
                        'name' => 'Անորոշ ինտեգրալ։',
                        'questions' => [
                            [
                                'name' => 'Ո՞րն է կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, որը պատկանում է X տիրույթին, F'(x) = f'(x)։",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, F'(x) = f(x)։",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, որը պատկանում է X տիրույթին, F'(x) = f(x)։",
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => "F(x) ֆունկցիան կոչվում y=f(x) ֆունկցիայի նախնական, որևէ X տիրույթում, եթե ցանկացած x կետի համար, F'(x) = f'(x)։",
                                        'is_true_answer' => 0
                                    ]
                                ]
                            ],
                            [
                                'name' => 'Ո՞րն է կոչվում f(x) ֆունկցիայի անորոշ ինտեգրալ։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'f(x)-ի ցանակցած նախնական։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'f(x)-ի ամենամեծ արժեք ունեցող նախնականը։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'f(x)-ի բոլոր նախնականների հատումը։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'f(x)-ի բոլոր նախնականների համախումբը։',
                                        'is_true_answer' => 1
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ի՞նչը կարելի է դուրս բերել ինտեգրալի նշանի տակից։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'Միայն բացասական գործակիցները։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Միայն դրական գործակիցները։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Հաստատուն արտադրիչը։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Ինտեգրալների գումարը։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'ֆունկցիայի նախնական',
                            'անորոշ ինտեգրալ',
                        ]
                    ],
                    [
                        'name' => 'Մի քանի փոփոխականների ֆունկցիաներ։',
                        'questions' => [
                            [
                                'name' => 'Նշվածներից, որն է հանդիսանում z=f(x, y) ֆունկցիայի (x0, y0) կետում, որպես անընդհատ ֆունկցիայի սահմանման կետ։',
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'Որոշված է (x0, y0) կետում։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Չունի վերջավոր սահման։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ունի վերջավոր սահման, x->y0, y->x0',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Ունի վերջավոր սահման, x->y0, y->x0, և այդ սահմանը հավասար է (x0, y0) կետում ֆունկցիայի արժեքին',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Ո՞րն է z=f(x, y) ֆունկցիայի աճը (x, y) կետում նկարագրող բանաձև։',
                                'level' => \App\Models\Question::LEVELS['high'],
                                'answers' => [
                                    [
                                        'name' => "Δz = f'x(x, y)Δx + f'x(x, y)Δy + αΔx + βΔy",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "Δz = f'x(x, y)Δx + f'y(x, y)Δy + (αΔx * βΔy)",
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => "Δz = f'x(x, y)Δx + f'y(x, y)Δy + αΔx + βΔy",
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => "Δz = f'x(x, y)Δx - f'y(x, y)Δy + αΔx + βΔy",
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => "Եթե z=f(x, y) ֆունկցիայի աճը (x, y) կետում կարելի է ներկայացնել Δz = f'x(x, y)Δx + f'y(x, y)Δy + αΔx + βΔy տեսքով, ապա f(x, y) ֆունկցիան այդ կետում կոչվում է (լրացնել այս հատվածը):",
                                'level' => \App\Models\Question::LEVELS['middle'],
                                'answers' => [
                                    [
                                        'name' => 'ածանցելի',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'դիֆերենցելի',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'սահմանափակ վերևից',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'անընդհատ դիֆերենցելի',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալների մասին:',
                                'level' => \App\Models\Question::LEVELS['high'],
                                'answers' => [
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնք իրարից տարբերվում են միայն ածանցման հերթականությամբ, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնք իրարից տարբերվում են ընդունած արժեքներով, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնց ածանցման հերթականությունը նույնն է, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե միևնույն ֆունկցիայի երկու խառը մասնակի ածանցյալները, որոնց ածանցման հերթականությունը հաջորդում են իրար, և անընդհատ են, ապա դրանք միմյանց հավասար են:',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Թեորեմ: Էքստրեմումի գոյության անհրաժեշտ պայմանը:',
                                'level' => \App\Models\Question::LEVELS['high'],
                                'answers' => [
                                    [
                                        'name' => 'Եթե z=f(x,y) դիֆերենցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի մասնակի ածանցյալները P կետում հավասար են 0-ի:',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'Եթե z=f(x,y) դիֆերենցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի մասնակի ածանցյալները P կետում հավասար է են ֆունկցիայի ընդունած մեծագույն արժեքին:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե z=f(x,y) ածանցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի խաղը մասնակի ածանցյալները P կետում հավասար են 0-ի:',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'Եթե z=f(x,y) ածանցելի ֆունկցիան իր որոշման տիրույթի որևէ P(x, y) կետում ունի էքստրեմում, ապա այդ ֆունկցիայի մասնակի ածանցյալները P կետում փոքր են 0-ից:',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ]
                        ],
                        'keyWords' => [
                            'Անընդհատ ֆունկցիա',
                            'Ֆունկցիայի աճ',
                            'Դիֆերենցելի ֆունկցիա',
                            'Թեորեմ երկու խաղը մասնակի ածանցյալների մասին',
                            'Էքստրեմումի գոյության անհրաժեշտ պայման',
                        ]
                    ],
                    [
                        'name' => 'Իրական և կոմպլեքս թվեր։',
                        'questions' => [
                            [
                                'name' => 'Կոմպլեքս թվերը համարվում են (լրացնել այս հատվածը):',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'իռացիոնալ թվեր',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'իրական թվերի դաշտի ընդլայնում',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'խորանարդ աստիճանի հավասարումների արմատներ',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'ռացիոնալ թվեր',
                                        'is_true_answer' => 0
                                    ]
                                ]
                            ],
                            [
                                'name' => 'Կոմպլեքս թվերին անվանում են նաև:',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'խաբուսիկ թվեր',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'իրական թվեր',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'կեղծ թվեր',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'անհայտ թվեր',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Նշվածներից ո՞րն է կոմպլեքս թվի ներկայացում։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'x + iy, որտեղ x-ը և y-ը իրական թվեր են, իսկ i-ն ռացիոնալ։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'x + iy, որտեղ x-ը իրական թիվ է, իսկ y-ը և i-ն կեղծ միավորներ են։',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'x + iy, որտեղ x-ը և y-ը իրական թվեր են, իսկ i-ն կեղծ միավոր է։',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'x + iy, որտեղ x-ը և y-ը կոմպլեքս թվեր են, իսկ i-ն կեղծ միավոր է։',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                            [
                                'name' => 'Կոմպլեքս թվերի հավասարությունը տեղի ունի, եթե (լրացնել այս հատվածը)։',
                                'level' => \App\Models\Question::LEVELS['easy'],
                                'answers' => [
                                    [
                                        'name' => 'հավասար են նրանց իրական և կեղծ մասերը',
                                        'is_true_answer' => 1
                                    ],
                                    [
                                        'name' => 'հավասար են նրանց կեղծ մասերը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'հավասար են նրանց իրական մասերը',
                                        'is_true_answer' => 0
                                    ],
                                    [
                                        'name' => 'հավասար են նրանց իրական կամ կեղծ մասերը',
                                        'is_true_answer' => 0
                                    ],
                                ]
                            ],
                        ],
                        'keyWords' => [
                            'Կոմպլեքս թիվ',
                            'Կեղծ միավոր',
                            'Կոմպլեքս թվերի հավասարություն',
                        ]
                    ],
                ]
            ]
        ]
    ];
}
